[
    {
        "id": "410544b2-4001-4271-9855-fec4b6a6442a",
        "title": "Automatic documentation for Polarity lang",
        "description": "My Bachelor Thesis",
        "content": "This thesis focuses on the automatic generation of HTML documentation for the experimental programming language Polarity. Polarity is built around the dual concepts of “data” and “codata” and combines both functional and object‐oriented programming paradigms. In particular, the work examines how Polarity source files can be parsed into an untyped syntax tree and then transformed—using Rust libraries such as pretty and Askama—into well‐structured, template‐based HTML pages. By separating content and presentation (via Askama templates and a central CSS stylesheet), the system produces a separate HTML document for each Polarity module, complete with syntax highlighting and hyperlinks.",
        "image_url": "/documentation.PNG",
        "link": "https://github.com/Phil-Ebsworth/polarity",
        "md_link": "polarity.md"
    },
    {
        "id": "d4e3f2a1-5c6d-4e7e-8f1a-9a0b1c2d3e4f",
        "title": "Bildgalerie",
        "description": "Ein visuelles Archiv experimenteller Promptkunst.",
        "content": "Die Bildgalerie ist eine kuratierte Sammlung fotorealistischer 8K-Bilder, die durch präzise Prompt-Generierung entstanden sind. Sie verbindet Technik mit Ästhetik und zeigt Themen wie Natur-Technik-Symbiosen, abstrakte Wesen und futuristische Landschaften. Die Galerie dient sowohl als kreatives Showcase als auch als Ausgangspunkt für explorative Projekte mit generativer KI.",
        "image_url": "/galerie.PNG",
        "link": "/main/showcase",
        "md_link": "bildgalerie.md"
    },
    {
        "id": "e5f4a3b2-6d7e-4f8f-9a1b-0c1d2e3f4g5h",
        "title": "Tab Library",
        "description": "Eine interaktive Bibliothek für Gitarren-Tabs.",
        "content": "Die Tab Library ist eine benutzerfreundliche Plattform zum Hochladen, Durchsuchen und Verwalten von Gitarren-Tabs. Nutzer können PDFs hinzufügen, Slugs generieren und Tabs nach Künstler oder Titel filtern. Entwickelt mit Next.js, PostgreSQL und NextAuth bietet sie einen schlanken Workflow für das persönliche Tab-Archiv oder kollaborative Nutzung. Perfekt für Musiker, die ihre Sammlung digitalisieren und teilen möchten.",
        "image_url": "/tab-bib.PNG",
        "link": "/main/tab-bib",
        "md_link": "tablibrary.md"
    },
    {
        "id": "b2c1f8d3-4e5a-4c6b-9f0e-7c8d9e0f1a2b",
        "title": "Roboarena",
        "description": "A small, top-down roguelike approach.",
        "content": "RoboArena is a compact, top-down roguelike built collaboratively in Pygame. You pilot a customizable combat robot through procedurally generated arenas, battling waves of mechanized foes and navigating environmental hazards. Each run challenges you to scavenge parts, upgrade your arsenal, and adapt your playstyle—whether you favor rapid-fire energy bursts, precision sniper shots, or close-quarters melee strikes. Developed with a few friends, RoboArena blends fast-paced action, tight resource management, and pixel-art charm into bite-sized sessions that keep you coming back for “just one more run.”",
        "image_url": "/roboarena.PNG",
        "link": "https://github.com/Phil-Ebsworth/Roboarena",
        "md_link": "roboarena.md"
    },
    {
        "id": "c3d2f1e0-4b5a-4c6b-9f0e-7c8d9e0f1a2b",
        "title": "Tick-Tack-Toe",
        "description": "A simple Tic-Tac-Toe game built with React.",
        "content": "This is a simple Tic-Tac-Toe game built with React. It features a clean interface, responsive design, and allows two players to compete against each other. The game keeps track of the score and displays the winner at the end of each game.",
        "image_url": "/tick-tack-toe.PNG",
        "link": "/tick-tack-toe",
        "md_link": "tick-tack-toe.md"
    }
]